# Задание 1: Анализ требований

### Раздел ТЗ: Функционал корзины

1. Пользователь может добавить в корзину от 1 до 10 единиц одного товара.
2. Пользователь может изменить количество каждого товара в корзине не менее, чем до 1-го. Для удаления товара из корзины используется отдельная кнопка.
3. В корзине может находиться не более 5 различных товаров.
4. Суммарное количество всех товаров в корзине не может превышать 20 штук.
5. Товары в корзине могут быть разные.
6. При попытке добавить товар, превышающий лимиты, система показывает сообщение: "Лимит корзины превышен".
7. Цена на продукт фиксируется на момент добавления в корзину и не меняется.
8. На странице корзины отображается список товаров, их количество, цена за единицу и общая стоимость позиции.
9. Если пользователь уменьшает количество товара до 0, товар удаляется из корзины.
10. В корзине может быть реклама других продуктов.
11. Реклама товаров в корзине должна быть каждый будний день по утрам и вечерам.
13. Если цена на товар изменилась в каталоге, система должна автоматически обновить ее в корзине у всех пользователей.

### Что нужно сделать:
1. Найдите и перечислите все логические противоречия и недочеты в предоставленном ТЗ. Объясните, в чем заключается проблема для каждого пункта.
2. Предложите конкретные исправления для устранения этих противоречий - напишите свою версию этого фрагмента ТЗ, которая должна быть логически завершенной и непротиворечивой.
3. Какие уточняющие вопросы вы бы задали продукт-менеджеру или бизнес-заказчику по этому ТЗ?

## 1. Противоречия и недочеты.
Противоречие: в п. 2 указано, что запрещено уменьшать количество товара до 0 и удалить товар можно только с помощью специальной кнопки, а в п. 9 – можно автоматически удалить товар, уменьшив его до 0. 
Проблема: неопределенность, как должна быть реализована логика.

Недочет: п. 5 («Товары в корзине могут быть разные») практически дублирует п.3 («В корзине может находиться не более 5 различных товаров»).
Проблема: лишняя информация.

Недочет: П.6 («При попытке добавить товар, превышающий лимиты, система показывает сообщение: "Лимит корзины превышен"») –  не указан, какой именно установлен лимит.
Проблема: Сообщение не совсем информативное.

Противоречие: в п. 7  указано, что цена в корзине фиксируется и не меняется, а в п.13 - цена в корзине обновляется в зависимости от изменений.
Проблема: невозможно реализовать сразу оба эти требования.

Недочет: в п. 8 не сказано про итоговую стоимость всех товаров

Недочет: в п. 11 («Реклама товаров в корзине должна быть каждый будний день по утрам и вечерам») – нет конкретного времени

Недочет: п. 12 отсутствует.

## 2. Исправленная версия ТЗ
Раздел ТЗ: Функционал корзины
1 Общие ограничения
1.1 Максимальное количество различных товарных позиций – 5.
1.2 Максимальное суммарное количество всех товарных единиц в корзине – 20.
 1.3 Ограничения (п. 1.1 и п. 1.2) проверяются одновременно при любом действии в корзине.
2. Добавление товара
2.1 Пользователь может добавить от 1 до 10 единиц одной товарной позиции.
2.2 Добавить товар можно только в случае, если ее результат не нарушает общие ограничения корзины (п. 1).
3. Управление товарами
Для каждой позиции в корзине есть элементы управления:
  •	кнопка увеличения количества единиц (+): активна, если текущее количество единиц товара меньше 10;
  •	кнопка уменьшения количества единиц (-): если в результате уменьшения количество единиц товара становится равным 0, данная позиция автоматически удаляется из корзины;
  •	кнопка удаления позиции (×): можно полностью удалить товарную позицию из корзины, независимо от текущего количества;
  •	товар автоматически удаляется из корзины, если перестает быть в наличии в каталоге.
4 Обработка превышения лимитов
Действие пользователя, которое нарушает любое ограничение из п.1.1, п.1.2, ведет к выводу сообщения: «В корзине может быть не более 5 различных видов товаров и не более 20 единиц товара». 
5 Ценообразование
Цена на товар фиксируется на момент добавления в корзину и не меняется на протяжении всего времени нахождения товара в корзине, даже в случае изменения цены данного товара в каталоге.
6 Структура страницы корзины
На странице корзины отображается:
  •	список товаров с отображением для каждой позиции наименования, количества, цены за единицу и общей стоимости позиции;
  •	элементы управления количеством и удалением для каждой позиции;
  •	итоговая сумма заказа;
  •	блок для отображения рекламы.  
7 График отображения рекламы
Реклама в корзине отображается в будние дни с 8:00 до 11:00 и с 18:00 до 21:00 по местному времени пользователя.

## 3. Уточняющие вопросы по ТЗ
•	Можно ли уменьшать количество товара до 0 для его автоматического удаления, или удалять можно только отдельной кнопкой? 
•	Фиксируется ли цена товара на момент добавления в корзину или автоматически обновляется при изменении в каталоге?
•	В сообщении «Лимит корзины превышен» (п. 6) нужно ли уточнять, какой именно лимит? Или это будет общее сообщение, не зависимо от того, какой лимит превышен?
•	Как пользователь регулирует количество единиц товара? 
•	Какое требование было пропущено (п. 12)? 
•	Реклама в корзине должна выглядеть как отдельный блок? Как определется время отображения рекламы?
• Если товар перестает быть в наличии в каталоге, то удаляется ли он из корзины?
